[{"title":"Junior Developer","shortname":"jd","employer":"TANG REN & CO. LIMITED, INCORPORATED","time":"May 2014 to Current","location":"Level 3, 20 Augustus Terrace, Parnell, Auckland","description":"Working as part of a developing team responsible for determining all necessary coding \n                    requirements for a sites creation including forms, e-commerce capability and specialized scripts \n                    and participating in the full life cycle of new website development. ","list":["Maintain and built multiple websites, including planning design and development of new system architecture using Java & Java EE , JSF, RESTful, EJB","Frontend and backend development and maintenance of MVC architecture websites and an internal CMS using OOP, PHP, HTML5\/CSS, MySQL, WYSIWYG, AJAX, JavaScript, JQuery, Bootstrap Framework, various CMS systems including Wordpress, Magento, and LAMP toolsets.","Implemented framework development and reduce development costs by at least 80%.","Managed the web design and development of the entire client websites: Mobile, Responsive Web, Intuitive User Experience, general SEO - including several sections, such as e-commerce pages, Page layout design, UI\/UX"],"demo":["www.eckomautoparts.com","www.bizwall.co.nz","www.yyfood.co.nz"],"icon":"ion-code-working"},{"title":"Web Developer","shortname":"wd","employer":"Ann’s Volcanic Motel","time":"April 2014 to May 2014","location":"107 Malfroy Road, Rotorua, New Zealand","description":"Responsible for maintaining features and capabilities of the website. Content and images update with FTP connection.  Performing Functional Testing and modification for existing code.","list":["Increased traffic by 35% in one month, and page views per visit by 50%.","Testing and validating work produced as part of the development process","Creating HTML pages based on graphic designs, developing CSS, JavaScript"],"demo":["www.rotoruamotel.co.nz"],"icon":"ion-code-working"},{"title":"Assignment Marker","shortname":"am","employer":"Auckland University of Technology","time":"July 2013 to December 2013","location":"55 Wellesley Street East, Auckland Central","description":"Responsible for collection and marking assignments for Algorithm Design and Analysis. Checking performance and cheating of assignments, and report to lecturer.","list":["Marker for Algorithm Design and Analysis","Assignment collection"],"demo":[],"icon":"ion-android-checkmark-circle"},{"title":"Student Volunteer","shortname":"sv","employer":"AUT Chinese Student Association","time":"March 2011 to December 2011","location":"Auckland University of Technology","description":"Responsible for computer maintenance and IT service for members of AUT Chinese Student Association, and events helper including publishing news online and student guide.","list":["IT service","Computer maintenance","Posting events online","Event assistant"],"demo":[],"icon":"ion-person-stalker"}]